{
	"nom": "GAMBIN",
	"prenom": "Jérémie",
	"address": "Rennes, Télétravail",
	"email": "jeremie.gambin@gmail.com",
	"phone": "06.24.89.44.49",
	"title": "Développeur Full-Stack Senior ",
	"punchLines": [
		"Conduite de projets de la conception à la livraison finale",
		"10 ans d'expérience en développement Full-Stack",
		"Expertise solide en conception d'API REST",
		"Pratiques DevOps : Git, Tests, intégration, et déploiement continu"
	],
	"stackOverFlowUrl": "https://stackoverflow.com/users/2988788",
	"drivingLicence": "Permis B",
	"githubUrl": "https://github.com/jbigman",
	"description": "Développeur expérimenté en applications web et mobiles, spécialisé en TypeScript, Node.js et React. Mes réalisations incluent la création d'une plateforme de réservation avec systèmes de paiement pour LaPetitePouzerie.fr et l'implémentation d'un moteur de recherche pour les jeux vidéo sur Gamewisher.com. À la recherche d'un poste de développeur à CoderPad, où je pourrais apporter mes compétences en développement front-end et back-end dans un environnement Agile, pour soutenir votre équipe Tech à renforcer vos produits et assurer leur évolutions.",
	"experiences": [
		[{
			"title": "Entreprenariat",
			"description": "Creation d'entreprise : Moteur de recherche et plateforme communautaire de partage",
			"company": "Gamewisher.com",
			"link": "https://www.gamewisher.com",
			"tasks": [
				"Développement complet du site internet avec <b>React18</b> et <b>Next.js</b>, incluant l’interface utilisateur et la gestion des performances front-end",
				"Utilisation de <b>MongoDB</b> pour le stockage et la gestion des données.",
				"Conception et mise en place du backend via une <b>API RESTful</b> basée sur <b>NestJS</b>, garantissant la communication fluide entre le front-end et le serveur.",
				"Automatisation des tests, de l'intégration continue et du déploiement via <b>Vitest</b> et <b>Github Actions</b>, assurant une livraison rapide et de haute qualité.",
				"Participation à des <a href=\"https://github.com/facundoolano/google-play-scraper\">projets open source</a> de scrapping de donnée"
			],
			"stack": [],
			"dateEnd": "Depuis 2019"
		}],
		[		{
			"title": "Développeur Full-Stack Freelance",
			"company": "LaPetitePouzerie.fr",
			"link": "https://www.LaPetitePouzerie.fr",
			"description" : "Plateforme de réservation de gîte incluant le paiement et la gestion des disponibilités",
			"tasks": [
				"Conception complète de l'API, du back-end et du front-end avec <b>TypeScript</b>, <b>NestJs</b> et <b>Next.js</b>, garantissant une architecture cohérente et performante.",
				"Intégration de l'API de paiement Stripe, facilitant des transactions sécurisées.",
				"<b>Collaboration avec un UX designer</b> pour assurer une expérience utilisateur optimale, en cohérence avec les meilleures pratiques en matière de design."
			],
			"stack": [
		],
			"dateStart": "Mars - Avril 2024",
			"dateEnd": ""
		},{
				"title": "",
				"company": "Eric C. Entrepreneur",
				"description" : "Application Android métier pour paramétrer l'ouverture de portes de laboratoires",
				"tasks": [ "Développement d'une application mobile MVP en <b>TypeScript</b> et <b>React Native</b>"],
				"stack": [],
				"dateStart": "Octobre 2022",
				"dateEnd": ""
			}
		],
		[{
			"title": "Développeur Full stack et Scrum master",
			"company": "Thales",
			"description" : "Application Android pour les chauffeurs de bus du réseau de transport danois, permettant la gestion des voyages, la vente de tickets et la configuration des valideurs",
			"tasks": [
				"Développement réalisé en collaboration avec un Product Owner anglophone en utilisant <b>TypeScript</b>, <b>React Native</b> et MQTT"
			],
			"stack": [],
			"dateStart": 2017,
			"dateEnd": 2018
		},{
			"title": "",
			"company": "",
			"description" : "Système déployé chez de nombreux opérateurs de transport à l'international permettant la gestion des titres de transport",
			"tasks": [ 
				"Conception et implémentation des fonctionnalités clés de l'<b>API REST</b> en Java sur un socle <b>PostgreSQL</b> et en utilisant le broker <b>RabbitMQ</b>", 
				"Développement en <b>Angular</b> du backend et des front-ends destinés aux administrateurs, guichetiers et voyageurs (monitoring équipement, suivi des voyages, gestion des cartes, abonnements).",
				"Tests automatisés : Mise en place de tests unitaires et d'intégration pour améliorer la couverture de code (80%) et la stabilité.",
				"<b>Scrum master dans une équipe Agile de 10 personnes</b>."
		 ],
			"stack": [],
			"dateStart": 2013,
			"dateEnd": 2017
		},{
			"title": "",
			"company": "",
			"description" : "Système billetique déployé pour le système de transport d'Auckland, NZ.",
			"tasks": [
				"Développement du back-office au sein d'<b>une équipe de 8 personnes</b> dans l'écosystème .net (C# ▪️ ASP.Net ▪️ <b>Microsoft SQL Server</b>)"
			],
			"stack": [],
			"dateStart": 2008,
			"dateEnd": 2013
		}]
	],
	"formations": [
		[{
			"title": "Ergonomie et UX des logiciels",
			"company": "Ludotic, Paris",
			"tasks": [],
			"stack": [],
			"dateEnd": 2014
		}],
		[{
			"title": "Expert en conduite et ingénierie de développement logiciel et système",
			"company": "Master ETGL au CFA AFTI, Orsay",
			"tasks": [],
			"stack": [],
			"dateEnd": 2010
		}],
		[{
			"title": "Licence Informatique",
			"description": "",
			"company": "Paris Sorbonne Université Institut Galilée",
			"duration": "",
			"tasks": [],
			"stack": [],
			"dateEnd": 2008
		}]
	],
	"skills": [
		{
			"type": "hard",
			"icon":"ts",
			"name": "TypeScript",
			"subtitle": "Certification CodinGame",
			"link": "https://www.codingame.com/certification/nxSxPg_AI-hssnpcSACqag"
		},
		{
			"type": "hard",
			"icon": "react",
			"name": "React / Next.js"
		},
		{
			"type": "hard",
			"icon": "node",
			"name": "Node.js / Nest.js"
		},
		{
			"type": "soft",
			"icon": "brain",
			"name": "Rigueur et organisation",
			"subtitle": "Gestion autonome des priorités, structure et optimise le code"
		},
		{
			"type": "soft",
			"icon": "autonomie",
			"name": "Curiosité",
			"subtitle": "Volonté d'apprendre et d'améliorer ses compétences en continu"
		},
		{
			"type": "soft",
			"icon": "fire",
			"name": "Esprit d'équipe",
			"subtitle": "Apte à communiquer et à collaborer avec des équipes pluridisciplinaires"
		}
	]
}